# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.14-s082_1 on Fri Dec 29 12:53:34 IST 2023

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design vedic8x8

create_clock -name "clk" -period 2.0 -waveform {0.0 1.0} [get_ports clk]
set_clock_transition 0.1 [get_clocks clk]
set_load -pin_load 0.15 [get_ports {result[15]}]
set_load -pin_load 0.15 [get_ports {result[14]}]
set_load -pin_load 0.15 [get_ports {result[13]}]
set_load -pin_load 0.15 [get_ports {result[12]}]
set_load -pin_load 0.15 [get_ports {result[11]}]
set_load -pin_load 0.15 [get_ports {result[10]}]
set_load -pin_load 0.15 [get_ports {result[9]}]
set_load -pin_load 0.15 [get_ports {result[8]}]
set_load -pin_load 0.15 [get_ports {result[7]}]
set_load -pin_load 0.15 [get_ports {result[6]}]
set_load -pin_load 0.15 [get_ports {result[5]}]
set_load -pin_load 0.15 [get_ports {result[4]}]
set_load -pin_load 0.15 [get_ports {result[3]}]
set_load -pin_load 0.15 [get_ports {result[2]}]
set_load -pin_load 0.15 [get_ports {result[1]}]
set_load -pin_load 0.15 [get_ports {result[0]}]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {a[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {a[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {a[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {a[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {a[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {a[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {a[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {a[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {b[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {b[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {b[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {b[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {b[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {b[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {b[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {b[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {result[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {result[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {result[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {result[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {result[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {result[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {result[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {result[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {result[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {result[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {result[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {result[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {result[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {result[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {result[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.8 [get_ports {result[0]}]
set_max_fanout 20.000 [current_design]
set_input_transition 0.12 [get_ports {a[7]}]
set_input_transition 0.12 [get_ports {a[6]}]
set_input_transition 0.12 [get_ports {a[5]}]
set_input_transition 0.12 [get_ports {a[4]}]
set_input_transition 0.12 [get_ports {a[3]}]
set_input_transition 0.12 [get_ports {a[2]}]
set_input_transition 0.12 [get_ports {a[1]}]
set_input_transition 0.12 [get_ports {a[0]}]
set_input_transition 0.12 [get_ports {b[7]}]
set_input_transition 0.12 [get_ports {b[6]}]
set_input_transition 0.12 [get_ports {b[5]}]
set_input_transition 0.12 [get_ports {b[4]}]
set_input_transition 0.12 [get_ports {b[3]}]
set_input_transition 0.12 [get_ports {b[2]}]
set_input_transition 0.12 [get_ports {b[1]}]
set_input_transition 0.12 [get_ports {b[0]}]
set_input_transition 0.12 [get_ports clk]
set_wire_load_mode "enclosed"
set_clock_uncertainty -setup 0.01 [get_ports clk]
set_clock_uncertainty -hold 0.01 [get_ports clk]
